Revit 2024 API
BuiltInFailures.WallFailures.InvalidBaseConstraintForLevel Property
 Base Constraint is invalid for the Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidBaseConstraintForLevel { get; }
Visual Basic
Public Shared ReadOnly Property InvalidBaseConstraintForLevel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidBaseConstraintForLevel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace